# Volatility Data Analysis

### February 13 2018

#### John Ngo

In [1]:
# import packages and function

import numpy as np
import pandas as pd
import matplotlib.mlab as mlab
import matplotlib.pyplot as plt

In [4]:
# import data and display the first few rows

vix = pd.read_csv('vix.csv')

vix.head()

         Date       Open       High        Low      Close  Adj Close  Volume
0  1990-01-02  17.240000  17.240000  17.240000  17.240000  17.240000       0
1  1990-01-03  18.190001  18.190001  18.190001  18.190001  18.190001       0
2  1990-01-04  19.219999  19.219999  19.219999  19.219999  19.219999       0
3  1990-01-05  20.110001  20.110001  20.110001  20.110001  20.110001       0
4  1990-01-08  20.260000  20.260000  20.260000  20.260000  20.260000       0

In [5]:
vx1 = pd.read_csv('v.csv')

vx1.head()

,Trade Date,Open,High,Low,Close,Settle,Change,Total Volume,EFP,Prev. Day Open Interest
0,2018-02-12,26.50,28.37,24.75,25.82,25.825,-1.35,105688.0,120.0,77788.0
1,2018-02-09,27.95,32.90,26.15,27.15,27.175,-0.92,187082.0,13.0,93755.0
2,2018-02-08,23.10,29.90,22.25,28.05,28.100,4.68,217066.0,6389.0,106139.0
3,2018-02-07,23.90,24.47,19.50,23.45,23.425,-0.45,214118.0,3510.0,126815.0
4,2018-02-06,31.75,33.25,20.00,23.90,23.875,-9.35,511008.0,4670.0,172816.0

In [6]:
vx2 = pd.read_csv('vv.csv')

vx2.head()

,Trade Date,Open,High,Low,Close,Settle,Change,Total Volume,EFP,Prev. Day Open Interest
0,2018-02-12,20.30,21.20,19.75,19.85,19.825,-0.60,183266.0,5507.0,235693.0
1,2018-02-09,21.60,23.44,20.34,20.40,20.425,-1.22,231284.0,917.0,231520.0
2,2018-02-08,19.70,23.39,18.75,21.60,21.650,1.78,270960.0,2598.0,224701.0
3,2018-02-07,20.45,20.90,17.80,19.90,19.875,-1.15,283310.0,0.0,218471.0
4,2018-02-06,27.40,28.00,18.10,21.00,21.025,-6.95,675499.0,10748.0,249519.0

In [10]:
spy = pd.read_csv('spy.csv')

spy.head()

         Date     Open     High      Low    Close  Adj Close   Volume
0  1993-01-29  43.9687  43.9687  43.7500  43.9375  27.466780  1003200
1  1993-02-01  43.9687  44.2500  43.9687  44.2500  27.662146   480500
2  1993-02-02  44.2187  44.3750  44.1250  44.3437  27.720715   201300
3  1993-02-03  44.4062  44.8437  44.3750  44.8125  28.013771   529400
4  1993-02-04  44.9687  45.0937  44.4687  45.0000  28.130983   531500

In [8]:
uvxy = pd.read_csv('uvxy.csv')

uvxy.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2011-10-04,48540000.0,48960000.0,41160000.0,41160000.0,41160000.0,0
1,2011-10-05,39492000.0,39780000.0,36276000.0,36276000.0,36276000.0,0
2,2011-10-06,36228000.0,37560000.0,34800000.0,34800000.0,34800000.0,0
3,2011-10-07,34116000.0,37152000.0,33696000.0,35304000.0,35304000.0,0
4,2011-10-10,33096000.0,33120000.0,31188000.0,31188000.0,31188000.0,0

In [9]:
vxx = pd.read_csv('vxx.csv')

vxx.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2009-01-30,102512.640625,107560.960938,102144.000000,107089.921875,107089.921875,200
1,2009-02-02,110694.398438,110694.398438,106434.562500,106752.000000,106752.000000,300
2,2009-02-03,106639.359375,106639.359375,101693.437500,101754.882813,101754.882813,100
3,2009-02-04,100608.000000,102799.359375,99328.000000,102133.757813,102133.757813,100
4,2009-02-05,104038.398438,106280.960938,100505.601563,101509.117188,101509.117188,200